Autodesk.Revit.DB.RenderingQualitySettings.IsCustomQuality
Checks if the current rendering quality is custom or not.
Returns:
True if the current rendering quality is custom, false otherwise.
Since:
2017

Autodesk.Revit.DB.RenderingQualitySettings.IsValidRenderTime(System.Int32)
Validate the render time is between 1 and 32768.
value:
The render time value to validate.
Returns:
True if the value is in the proper range, false otherwise.
Since:
2017

Autodesk.Revit.DB.RenderingQualitySettings.IsValidRenderLevel(System.Int32)
Validate the render level is between 1 and 40
value:
The render level value to validate.
Returns:
True if the render level value is in the proper range, false otherwise.
Since:
2017

Autodesk.Revit.DB.RenderingQualitySettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RenderingQualitySettings.RenderTime
The render target time as a numerical value between 1 and 32768.
Remarks:
Increase this value to increase render time.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value is not valid RenderTime.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2017

Autodesk.Revit.DB.RenderingQualitySettings.RenderLevel
The render target level as a numerical value between 1 and 40.
Remarks:
Increase this value to increase render level.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value is not valid for RenderLevel.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2017

Autodesk.Revit.DB.RenderingQualitySettings.RenderDuration
A value that controls render duration.
Remarks:
The duration of rendering.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value is not valid for RenderDuration.
-or-
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2017

Autodesk.Revit.DB.RenderingQualitySettings.LightAndMaterialAccuracyMode
A value that controls light and material accuracy mode.
Remarks:
The method of the renderer engine dealing with materials and shadows.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RenderingQualitySettings does not use custom quality currently.
To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Since:
2017

Autodesk.Revit.DB.RenderingQualitySettings.RenderingQuality
The quality applied for rendering.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.RenderingQualitySettings
Represents the quality settings of rendering.
Remarks:
The other properties in this class can only be modified if the RenderingQuality property is currently set to Custom.